cask_args appdir: "/Applications"

tap "homebrew/cask"

# Utils
#brew "imagemagick"
cask "iterm2", args: { appdir: "~/Applications" }
brew "wget"
brew "youtube-dl"

# Browsers
cask "firefox"
cask "google-chrome"

# Common
cask "dropbox"
cask "spotify"

# Business
cask "slack", args: { appdir: "~/Applications" }

# Development
#brew "ant"
cask "fastlane"
#cask "java" unless system "/usr/libexec/java_home --failfast"
cask "jetbrains-toolbox", args: { appdir: "~/Applications" }
cask "sourcetree", args: { appdir: "~/Applications" }
cask "visual-studio-code", args: { appdir: "~/Applications" }

# App Store
mas "1Password", id: 443987910
mas "Evernote", id: 406056744
mas "Slack", id: 803453959
mas "TheUnarchiver", id: 425424353
mas "Xcode", id: 497799835
